# DATA2001 Assignment - Team 3 ðŸ§ ðŸ“Š

**Group Name**: Data Princesses

**Team Members**: Michella Krishna, Yujia Liu, Katherine Kong

**Region Focus**: City and Inner South, North Sydney and Hornsby, Inner West

## Table of Contents

##  Task 1: Data Preparation

In [23]:
# Business cleaning
import pandas as pd

# Load the dataset
businesses = pd.read_csv("Businesses.csv")

# Clean column names: lowercase and replace special characters
businesses.columns = (
    businesses.columns
    .str.lower()
    .str.replace(" ", "_", regex=False)
    .str.replace("-", "_", regex=False)
)

businesses = businesses.rename(columns={
    "0_to_50k_businesses": "b_0_50k",
    "50k_to_200k_businesses": "b_50k_200k",
    "200k_to_2m_businesses": "b_200k_2m",
    "2m_to_5m_businesses": "b_2m_5m",
    "5m_to_10m_businesses": "b_5m_10m",
    "10m_or_more_businesses": "b_10m_more"
})

# Preview cleaned column names
print("Cleaned columns:", businesses.columns.tolist())

# Confirm data types and nulls (should be fine)
print(businesses.info())
print(businesses.isnull().sum())

# Export the cleaned dataset
businesses.to_csv("b_cleaned.csv", index=False)

businesses.head()

Cleaned columns: ['industry_code', 'industry_name', 'sa2_code', 'sa2_name', 'b_0_50k', 'b_50k_200k', 'b_200k_2m', 'b_2m_5m', 'b_5m_10m', 'b_10m_more', 'total_businesses']
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12217 entries, 0 to 12216
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   industry_code     12217 non-null  object
 1   industry_name     12217 non-null  object
 2   sa2_code          12217 non-null  int64
 3   sa2_name          12217 non-null  object
 4   b_0_50k           12217 non-null  int64
 5   b_50k_200k        12217 non-null  int64
 6   b_200k_2m         12217 non-null  int64
 7   b_2m_5m           12217 non-null  int64
 8   b_5m_10m          12217 non-null  int64
 9   b_10m_more        12217 non-null  int64
 10  total_businesses  12217 non-null  int64
dtypes: int64(8), object(3)
memory usage: 1.0+ MB
None
industry_code       0
industry_name       0
sa2_code            0
sa2_name            0
b_0_50k             0
b_50k_200k          0
b_200k_2m           0
b_2m_5m             0
b_5m_10m            0
b_10m_more          0
total_businesses    0
dtype: int64

,industry_code,industry_name,sa2_code,sa2_name,b_0_50k,b_50k_200k,b_200k_2m,b_2m_5m,b_5m_10m,b_10m_more,total_businesses
0,A,"Agriculture, Forestry and Fishing",101021007,Braidwood,136,92,63,4,0,0,296
1,A,"Agriculture, Forestry and Fishing",101021008,Karabar,6,3,0,0,0,0,9
2,A,"Agriculture, Forestry and Fishing",101021009,Queanbeyan,6,4,3,0,0,3,15
3,A,"Agriculture, Forestry and Fishing",101021010,Queanbeyan - East,0,3,0,0,0,0,3
4,A,"Agriculture, Forestry and Fishing",101021012,Queanbeyan West - Jerrabomberra,7,4,5,0,0,0,16

In [25]:
#Population Cleaning
# Load the data
population = pd.read_csv("Population.csv")

# Clean column names: lowercase, replace hyphens and spaces with underscores
population.columns = (
    population.columns
    .str.lower()
    .str.replace("-", "_")
    .str.replace(" ", "_")
)

# Define new column names
new_columns = {
    'sa2_code': 'sa2_code',
    'sa2_name': 'sa2_name',
    '0_4_people': 'age_0_4',
    '5_9_people': 'age_5_9',
    '10_14_people': 'age_10_14',
    '15_19_people': 'age_15_19',
    '20_24_people': 'age_20_24',
    '25_29_people': 'age_25_29',
    '30_34_people': 'age_30_34',
    '35_39_people': 'age_35_39',
    '40_44_people': 'age_40_44',
    '45_49_people': 'age_45_49',
    '50_54_people': 'age_50_54',
    '55_59_people': 'age_55_59',
    '60_64_people': 'age_60_64',
    '65_69_people': 'age_65_69',
    '70_74_people': 'age_70_74',
    '75_79_people': 'age_75_79',
    '80_84_people': 'age_80_84',
    '85_and_over_people': 'age_85_over',
    'total_people': 'total'
}

# Rename columns
population.rename(columns=new_columns, inplace=True)

# Show renamed columns
print("Renamed columns:", population.columns.tolist())

# Confirm data types and nulls
print(population.info())
print(population.isnull().sum())

# Export cleaned and renamed dataset
population.to_csv("p_cleaned.csv", index=False)

# Preview the data
print(population.head())

Renamed columns: ['sa2_code', 'sa2_name', 'age_0_4', 'age_5_9', 'age_10_14', 'age_15_19', 'age_20_24', 'age_25_29', 'age_30_34', 'age_35_39', 'age_40_44', 'age_45_49', 'age_50_54', 'age_55_59', 'age_60_64', 'age_65_69', 'age_70_74', 'age_75_79', 'age_80_84', 'age_85_over', 'total']
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 373 entries, 0 to 372
Data columns (total 21 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sa2_code     373 non-null    int64
 1   sa2_name     373 non-null    object
 2   age_0_4      373 non-null    int64
 3   age_5_9      373 non-null    int64
 4   age_10_14    373 non-null    int64
 5   age_15_19    373 non-null    int64
 6   age_20_24    373 non-null    int64
 7   age_25_29    373 non-null    int64
 8   age_30_34    373 non-null    int64
 9   age_35_39    373 non-null    int64
 10  age_40_44    373 non-null    int64
 11  age_45_49    373 non-null    int64
 12  age_50_54    373 non-null    int64
 13  age_55_59    373 non-null    int64
 14  age_60_64    373 non-null    int64
 15  age_65_69    373 non-null    int64
 16  age_70_74    373 non-null    int64
 17  age_75_79    373 non-null    int64
 18  age_80_84    373 non-null    int64
 19  age_85_over  373 non-null    int64
 20  total        373 non-null    int64
dtypes: int64(20), object(1)
memory usage: 61.3+ KB
None
sa2_code       0
sa2_name       0
age_0_4        0
age_5_9        0
age_10_14      0
age_15_19      0
age_20_24      0
age_25_29      0
age_30_34      0
age_35_39      0
age_40_44      0
age_45_49      0
age_50_54      0
age_55_59      0
age_60_64      0
age_65_69      0
age_70_74      0
age_75_79      0
age_80_84      0
age_85_over    0
total          0
dtype: int64
    sa2_code                     sa2_name  age_0_4  age_5_9  age_10_14  \
0  102011028     Avoca Beach - Copacabana      424      522        623
1  102011029  Box Head - MacMasters Beach      511      666        702
2  102011030              Calga - Kulnura      200      225        258
3  102011031          Erina - Green Point      683      804        880
4  102011032        Gosford - Springfield     1164     1044       1084

   age_15_19  age_20_24  age_25_29  age_30_34  age_35_39  ...  age_45_49  \
0        552        386        222        306        416  ...        572
1        592        461        347        420        535  ...        749
2        278        274        227        214        286  ...        325
3        838        661        502        587        757  ...        859
4       1072       1499       1864       1750       1520  ...       1330

   age_50_54  age_55_59  age_60_64  age_65_69  age_70_74  age_75_79  \
0        602        570        520        464        369        226
1        749        794        895        863        925        603
2        436        422        397        327        264        190
3        882        901        930        917       1065        976
4       1241       1377       1285       1166        949        664

   age_80_84  age_85_over  total
0        142           70   7530
1        331          264  11052
2        100           75   4748
3        773         1028  14803
4        476          537  21346

[5 rows x 21 columns]

In [27]:
# Income cleaning
import numpy as np

# Load your dataset
df = pd.read_csv('Income.csv')

# 1. Rename column names to lowercase
df.columns = df.columns.str.lower()

# 2. Replace spaces with underscores
df.columns = df.columns.str.replace(' ', '_')

# 3. Replace hyphens with underscores

df.columns = df.columns.str.replace('-', '_')

df.replace("np", np.nan, inplace=True)

# 4. Drop rows with null values
df.dropna(inplace=True)

df.rename(columns={
    'sa2_code21': 'sa2_code'
}, inplace=True)

# Export cleaned and renamed dataset
df.to_csv("i_cleaned.csv", index=False)

# View the cleaned DataFrame
df.head()

,sa2_code,sa2_name,earners,median_age,median_income,mean_income
0,101021007,Braidwood,2467,51,46640,68904
1,101021008,Karabar,5103,42,65564,69672
2,101021009,Queanbeyan,7028,39,63528,69174
3,101021010,Queanbeyan - East,3398,39,66148,74162
4,101021012,Queanbeyan West - Jerrabomberra,8422,44,78630,91981

In [29]:
# Schools

import pandas as pd
import geopandas as gpd
from shapely.geometry import Point, Polygon, MultiPolygon
from geoalchemy2 import Geometry, WKTElement
import matplotlib.pyplot as plt

In [31]:
import geopandas as gpd
# Adjust path as needed
catchments_primary = gpd.read_file("~/Desktop/DATA2001/DATA2001-A/catchments/catchments_primary.shp")

catchments_primary.columns = catchments_primary.columns.str.lower()

# Preview structure
print(catchments_primary.columns)
catchments_primary.head()

Index(['use_id', 'catch_type', 'use_desc', 'add_date', 'kindergart', 'year1',
       'year2', 'year3', 'year4', 'year5', 'year6', 'year7', 'year8', 'year9',
       'year10', 'year11', 'year12', 'priority', 'geometry'],
      dtype='object')

,use_id,catch_type,use_desc,add_date,kindergart,year1,year2,year3,year4,year5,year6,year7,year8,year9,year10,year11,year12,priority,geometry
0,2838,PRIMARY,Parklea PS,20181210,Y,Y,Y,Y,Y,Y,Y,N,N,N,N,N,N,None,"POLYGON ((150.93564 -33.71612, 150.93715 -33.7..."
1,2404,PRIMARY,Lindfield EPS,20211219,Y,Y,Y,Y,Y,Y,Y,N,N,N,N,N,N,None,"POLYGON ((151.18336 -33.74748, 151.18443 -33.7..."
2,4393,PRIMARY,Carlingford WPS,20220223,Y,Y,Y,Y,Y,Y,Y,N,N,N,N,N,N,None,"POLYGON ((151.04518 -33.77303, 151.04526 -33.7..."
3,4615,PRIMARY,Caddies Ck PS,20181210,Y,Y,Y,Y,Y,Y,Y,N,N,N,N,N,N,None,"POLYGON ((150.92567 -33.7296, 150.92602 -33.72..."
4,3918,PRIMARY,Killara PS,20211219,Y,Y,Y,Y,Y,Y,Y,N,N,N,N,N,N,None,"POLYGON ((151.15379 -33.75586, 151.15404 -33.7..."

In [33]:
# Adjust path as needed
catchments_secondary = gpd.read_file("~/Desktop/DATA2001/DATA2001-A/catchments/catchments_secondary.shp")

catchments_secondary.columns = catchments_secondary.columns.str.lower()

# Preview structure
print(catchments_secondary.columns)
catchments_secondary.head()

Index(['use_id', 'catch_type', 'use_desc', 'add_date', 'kindergart', 'year1',
       'year2', 'year3', 'year4', 'year5', 'year6', 'year7', 'year8', 'year9',
       'year10', 'year11', 'year12', 'priority', 'geometry'],
      dtype='object')

,use_id,catch_type,use_desc,add_date,kindergart,year1,year2,year3,year4,year5,year6,year7,year8,year9,year10,year11,year12,priority,geometry
0,8503,HIGH_COED,Billabong HS,20200507,N,N,N,N,N,N,N,Y,Y,Y,Y,Y,Y,None,"POLYGON ((146.67182 -35.31444, 146.6893 -35.31..."
1,8266,HIGH_COED,James Fallon HS,20200507,N,N,N,N,N,N,N,Y,Y,Y,Y,Y,Y,None,"POLYGON ((147.08734 -35.86271, 147.10413 -35.8..."
2,8505,HIGH_COED,Murray HS,20200507,N,N,N,N,N,N,N,Y,Y,Y,Y,Y,Y,None,"POLYGON ((146.81448 -35.78341, 146.8125 -35.79..."
3,8458,HIGH_COED,Kingswood HS,20201016,N,N,N,N,N,N,N,Y,Y,Y,Y,Y,Y,None,"MULTIPOLYGON (((150.686 -33.74031, 150.68631 -..."
4,8559,HIGH_COED,Jamison HS,20201016,N,N,N,N,N,N,N,Y,Y,Y,Y,Y,Y,None,"POLYGON ((150.69513 -33.75627, 150.68936 -33.7..."

In [35]:
# Adjust path as needed
catchments_future = gpd.read_file("~/Desktop/DATA2001/DATA2001-A/catchments/catchments_future.shp")

catchments_future.columns = catchments_future.columns.str.lower()

# Preview structure
print(catchments_future.columns)
catchments_future.head()

Index(['use_id', 'catch_type', 'use_desc', 'add_date', 'kindergart', 'year1',
       'year2', 'year3', 'year4', 'year5', 'year6', 'year7', 'year8', 'year9',
       'year10', 'year11', 'year12', 'geometry'],
      dtype='object')

,use_id,catch_type,use_desc,add_date,kindergart,year1,year2,year3,year4,year5,year6,year7,year8,year9,year10,year11,year12,geometry
0,8416,HIGH_COED,Ku-ring-gai HS,20230114,0,0,0,0,0,0,0,2024,2024,2024,2024,2024,2024,"POLYGON ((151.19849 -33.5399, 151.19945 -33.54..."
1,8161,HIGH_BOYS,Randwick BHS,20200220,0,0,0,0,0,0,0,2024,2024,2024,2024,2024,2024,"POLYGON ((151.27152 -33.91402, 151.27152 -33.9..."
2,8539,HIGH_COED,SSC Blackwattle Bay,20220609,0,0,0,0,0,0,0,0,0,0,0,2024,2024,"POLYGON ((151.15292 -33.83939, 151.16144 -33.8..."
3,8400,HIGH_COED,St Ives HS,20230114,0,0,0,0,0,0,0,2024,2024,2024,2024,2024,2024,"POLYGON ((151.17794 -33.6982, 151.17859 -33.69..."
4,8555,HIGH_COED,Rose Bay SC,20200220,0,0,0,0,0,0,0,2024,2024,2024,2024,2024,2024,"POLYGON ((151.28072 -33.83287, 151.28095 -33.8..."

In [52]:
from sqlalchemy import create_engine, text
import psycopg2
import psycopg2.extras
import json
import os
import pandas as pd

credentials = os.path.expanduser("~/Desktop/DATA2001/Tutorial/Credentials.json")


def pgconnect(credential_filepath, db_schema="public"):
    with open(credential_filepath) as f:
        db_conn_dict = json.load(f)
        host       = db_conn_dict['host']
        db_user    = db_conn_dict['user']
        db_pw      = db_conn_dict['password']
        default_db = "assignment"  ##### The right database
        port       = db_conn_dict['port']
        try:
            db = create_engine(f'postgresql+psycopg2://{db_user}:{db_pw}@{host}:{port}/{default_db}', echo=False)
            conn = db.connect()
            print('Connected successfully.')
        except Exception as e:
            print("Unable to connect to the database.")
            print(e)
            db, conn = None, None
        return db,conn

def query(conn, sqlcmd, args=None, df=True):
    result = pd.DataFrame() if df else None
    try:
        if df:
            result = pd.read_sql_query(sqlcmd, conn, params=args)
        else:
            result = conn.execute(text(sqlcmd), args).fetchall()
            result = result[0] if len(result) == 1 else result
    except Exception as e:
        print("Error encountered: ", e, sep='\n')
    return result

In [54]:
db, conn = pgconnect(credentials)

Connected successfully.

In [41]:
import geopandas as gpd

# Define shapefile paths
base_path = "~/Desktop/DATA2001/DATA2001-A/catchments/"
shapefiles = {
    "catchments_primary": "catchments_primary.shp",
    "catchments_secondary": "catchments_secondary.shp",
    "catchments_future": "catchments_future.shp"
}

# Loop through the catchment files and upload to PGadmin
for table_name, shp_file in shapefiles.items():
    print(f"Processing {table_name}...")
    gdf = gpd.read_file(os.path.expanduser(os.path.join(base_path, shp_file)))
    gdf.columns = [col.lower() for col in gdf.columns]  
    gdf.to_postgis(name=table_name, con=db, if_exists="replace", index=False)
    print(f"Uploaded {table_name} successfully.")

print(f"Using DB: {db.url.database}")

Processing catchments_primary...
Uploaded catchments_primary successfully.
Processing catchments_secondary...
Uploaded catchments_secondary successfully.
Processing catchments_future...
Uploaded catchments_future successfully.
Using DB: assignment

In [42]:
#### STOPS CLEANING AND FILTERING
import pandas as pd
# Load stops.txt
stops = pd.read_csv('Stops.txt')

# Preview
stops.head()

# Some cleaning
# Drop rows where stop_lat or stop_lon is missing
stops = stops.dropna(subset=['stop_lat', 'stop_lon'])

# We want to only select the stops inside three areas: 
# Inner West, North Sydney and Hornsby, City and Inner South

# No column name telling which region a stop belongs to
# So: use the stop's latitude and longitude (stop_lat, stop_lon) to filter our disired data

In [45]:
import geopandas as gpd
sa2 = gpd.read_file("~/Desktop/DATA2001/DATA2001-A/SA2_2021_AUST_SHP_GDA2020/SA2_2021_AUST_GDA2020.shp")

print(sa2.columns)
sa2.head()

sa2_sydney = sa2[sa2['GCC_NAME21'] == 'Greater Sydney']

# Create geometry column for stops
stops['geometry'] = stops.apply(lambda row: Point(row['stop_lon'], row['stop_lat']), axis=1)

# Turn stops into a GeoDataFrame (same CRS)
stops_gdf = gpd.GeoDataFrame(stops, geometry='geometry', crs="EPSG:4326") #4326

stops_gdf = stops_gdf.to_crs(epsg=7844)

stops_with_sa2 = gpd.sjoin(stops_gdf, sa2_sydney, how='left', predicate='within')

# print(stops_with_sa2.head(10)) #debug

target_regions = [
    'Sydney - Inner West',
    'Sydney - North Sydney and Hornsby',
    'Sydney - City and Inner South'
]

filtered_stops = stops_with_sa2[stops_with_sa2['SA4_NAME21'].isin(target_regions)]

filtered_stops = filtered_stops.dropna(subset=['SA4_NAME21'])

columns_to_keep = [
    'stop_id', 'stop_name', 'stop_lat', 'stop_lon',
    'wheelchair_boarding', 'SA2_CODE21', 'SA2_NAME21', 'SA4_NAME21', 'geometry'
]

filtered_stops = filtered_stops[columns_to_keep]

filtered_stops.columns = filtered_stops.columns.str.lower()

filtered_stops.to_csv('s_filtered.csv', index=False)

Index(['SA2_CODE21', 'SA2_NAME21', 'CHG_FLAG21', 'CHG_LBL21', 'SA3_CODE21',
       'SA3_NAME21', 'SA4_CODE21', 'SA4_NAME21', 'GCC_CODE21', 'GCC_NAME21',
       'STE_CODE21', 'STE_NAME21', 'AUS_CODE21', 'AUS_NAME21', 'AREASQKM21',
       'LOCI_URI21', 'geometry'],
      dtype='object')

In [46]:
# SA2 regions cleaning
sa2_path = "~/Desktop/DATA2001/DATA2001-A/SA2_regions/SA2_2021_AUST_GDA2020.shp"
sa2_gdf = gpd.read_file(os.path.expanduser(sa2_path))

#Keep only useful columns
sa2_gdf.columns = [col.lower() for col in sa2_gdf.columns]
columns_to_keep = ["sa2_code21", "sa2_name21", "sa4_name21", "geometry"]
sa2_gdf = sa2_gdf[columns_to_keep]

# Filter rows by target SA4 regions
target_sa4 = [
    "Sydney - Inner West",
    "Sydney - North Sydney and Hornsby",
    "Sydney - City and Inner South"
]
sa2_gdf = sa2_gdf[sa2_gdf["sa4_name21"].isin(target_sa4)]

# SUpload to PostgreSQL
sa2_gdf.to_postgis(name="sa2_regions", con=db, if_exists="replace", index=False)

print(f"âœ… Cleaned and uploaded 'sa2_regions' with {len(sa2_gdf)} rows.")
sa2_gdf.head()

âœ… Cleaned and uploaded 'sa2_regions' with 74 rows.

,sa2_code21,sa2_name21,sa4_name21,geometry
343,117011320,Banksmeadow,Sydney - City and Inner South,"POLYGON ((151.20807 -33.95405, 151.20817 -33.9..."
344,117011321,Botany,Sydney - City and Inner South,"POLYGON ((151.18965 -33.94813, 151.18919 -33.9..."
345,117011323,Pagewood - Hillsdale - Daceyville,Sydney - City and Inner South,"POLYGON ((151.22312 -33.92869, 151.22189 -33.9..."
346,117011324,Port Botany Industrial,Sydney - City and Inner South,"POLYGON ((151.22091 -33.96895, 151.22066 -33.9..."
347,117011325,Sydney Airport,Sydney - City and Inner South,"POLYGON ((151.17103 -33.927, 151.17167 -33.926..."

In [47]:
# Import everything into each person's local server, using the same column name

## Task 2

In [56]:
import requests
import io
import geopandas as gpd
northSydney_gdf = gpd.read_postgis("""
    SELECT *
    FROM sa2_regions
    WHERE sa4_name21 = 'Sydney - North Sydney and Hornsby'
""", conn, geom_col="geometry")

innerwest_gdf = gpd.read_postgis("""
    SELECT *
    FROM sa2_regions
    WHERE sa4_name21 = 'Sydney - Inner West'
""", conn, geom_col="geometry")

city_gdf = gpd.read_postgis("""
        SELECT *
        FROM sa2_regions
        WHERE sa4_name21 = 'Sydney - City and Inner South'
    """, conn, geom_col="geometry")

In [58]:
import requests
import io
import geopandas as gpd

def get_pois_from_bbox(minx, miny, maxx, maxy):
    url = "https://maps.six.nsw.gov.au/arcgis/rest/services/public/NSW_POI/MapServer/0/query"
    params = {
        "f": "geojson",
        "geometryType": "esriGeometryEnvelope",
        "geometry": f"{minx},{miny},{maxx},{maxy}",
        "spatialRel": "esriSpatialRelIntersects",
        "outFields": "*",
        "inSR": "4283",
        "outSR": "4283"
    }
    try:
        response = requests.get(url, params=params)
        response.raise_for_status()
        return gpd.read_file(io.StringIO(response.text))
    except Exception as e:
        print(f" Error fetching POIs for bbox {minx},{miny},{maxx},{maxy}:", e)
        return None

In [60]:
import time
from shapely.geometry import shape

all_pois_northsydney = []
#northsydn
for _, row in northSydney_gdf.iterrows():
    sa2 = row["sa2_name21"]
    minx, miny, maxx, maxy = row["geometry"].bounds
    print(f"Fetching POIs for {sa2}...")
    
    pois = get_pois_from_bbox(minx, miny, maxx, maxy)
    if pois is not None and not pois.empty:
        pois["sa2_name"] = sa2
        all_pois_northsydney.append(pois)
    
    time.sleep(1)  # be nice to the server
    
#innerwest
all_pois_innerwest = []
for _, row in innerwest_gdf.iterrows():
    sa2 = row["sa2_name21"]
    minx, miny, maxx, maxy = row["geometry"].bounds
    print(f"Fetching POIs for {sa2}...")
    
    pois = get_pois_from_bbox(minx, miny, maxx, maxy)
    if pois is not None and not pois.empty:
        pois["sa2_name"] = sa2
        all_pois_innerwest.append(pois)
    
    time.sleep(1)  # be nice to the server

# city
all_pois_city = []

for _, row in city_gdf.iterrows():
    sa2 = row["sa2_name21"]
    minx, miny, maxx, maxy = row["geometry"].bounds
    print(f"ðŸ“¦ Fetching POIs for {sa2}...")
    
    pois = get_pois_from_bbox(minx, miny, maxx, maxy)
    if pois is not None and not pois.empty:
        pois["sa2_name"] = sa2
        all_pois_city.append(pois)
    
    time.sleep(1)  # be nice to the server

print("done!!!!!")

Fetching POIs for Chatswood (West) - Lane Cove North...
Fetching POIs for St Leonards - Naremburn...
Fetching POIs for Artarmon...
Fetching POIs for Castle Cove - Northbridge...
Fetching POIs for Chatswood - East...
Fetching POIs for Greenwich - Riverview...
Fetching POIs for Lane Cove...
Fetching POIs for Willoughby...
Fetching POIs for Asquith - Mount Colah...
Fetching POIs for Berowra - Brooklyn - Cowan...
Fetching POIs for Normanhurst - Thornleigh - Westleigh...
Fetching POIs for Hornsby - East...
Fetching POIs for Hornsby - West...
Fetching POIs for Wahroonga (West) - Waitara...
Fetching POIs for Gordon - Killara...
Fetching POIs for Lindfield - Roseville...
Fetching POIs for Pymble...
Fetching POIs for St Ives...
Fetching POIs for Turramurra...
Fetching POIs for Wahroonga (East) - Warrawee...
Fetching POIs for Cremorne - Cammeray...
Fetching POIs for Crows Nest - Waverton...
Fetching POIs for Neutral Bay - Kirribilli...
Fetching POIs for North Sydney - Lavender Bay...
Fetching POIs for Mosman - North...
Fetching POIs for Mosman - South...
Fetching POIs for Concord - Mortlake - Cabarita...
Fetching POIs for Drummoyne - Rodd Point...
Fetching POIs for Five Dock - Abbotsford...
Fetching POIs for Concord West - North Strathfield...
Fetching POIs for Rhodes...
Fetching POIs for Balmain...
Fetching POIs for Lilyfield - Rozelle...
Fetching POIs for Annandale (NSW)...
Fetching POIs for Leichhardt...
Fetching POIs for Canterbury (North) - Ashbury...
Fetching POIs for Croydon Park - Enfield...
Fetching POIs for Dulwich Hill - Lewisham...
Fetching POIs for Haberfield - Summer Hill...
Fetching POIs for Homebush...
Fetching POIs for Strathfield South...
Fetching POIs for Ashfield - North...
Fetching POIs for Ashfield - South...
Fetching POIs for Burwood (NSW)...
Fetching POIs for Croydon...
Fetching POIs for Strathfield - East...
Fetching POIs for Strathfield - West...
ðŸ“¦ Fetching POIs for Banksmeadow...
ðŸ“¦ Fetching POIs for Botany...
ðŸ“¦ Fetching POIs for Pagewood - Hillsdale - Daceyville...
ðŸ“¦ Fetching POIs for Port Botany Industrial...
ðŸ“¦ Fetching POIs for Sydney Airport...
ðŸ“¦ Fetching POIs for Eastlakes...
ðŸ“¦ Fetching POIs for Mascot...
ðŸ“¦ Fetching POIs for Petersham - Stanmore...
ðŸ“¦ Fetching POIs for Sydenham - Tempe - St Peters...
ðŸ“¦ Fetching POIs for Marrickville - North...
ðŸ“¦ Fetching POIs for Marrickville - South...
ðŸ“¦ Fetching POIs for Darlinghurst...
ðŸ“¦ Fetching POIs for Erskineville - Alexandria...
ðŸ“¦ Fetching POIs for Glebe - Forest Lodge...
ðŸ“¦ Fetching POIs for Potts Point - Woolloomooloo...
ðŸ“¦ Fetching POIs for Surry Hills...
ðŸ“¦ Fetching POIs for Camperdown - Darlington...
ðŸ“¦ Fetching POIs for Chippendale...
ðŸ“¦ Fetching POIs for Newtown (NSW)...
ðŸ“¦ Fetching POIs for Pyrmont...
ðŸ“¦ Fetching POIs for Redfern...
ðŸ“¦ Fetching POIs for Rosebery - Beaconsfield...
ðŸ“¦ Fetching POIs for Sydney (North) - Millers Point...
ðŸ“¦ Fetching POIs for Sydney (South) - Haymarket...
ðŸ“¦ Fetching POIs for Ultimo...
ðŸ“¦ Fetching POIs for Waterloo...
ðŸ“¦ Fetching POIs for Zetland...
done!!!!!

In [62]:
from geopandas import GeoDataFrame

#north sydney 
if all_pois_northsydney:
    all_pois_gdf = gpd.GeoDataFrame(pd.concat(all_pois_northsydney, ignore_index=True), crs="EPSG:4283")
    all_pois_gdf.to_postgis("pois_northSydney", con=db, if_exists="replace", index=False)
    print(f"Uploaded {len(all_pois_gdf)} POIs.")
else:
    print("No POIs collected.")

#inner west
if all_pois_innerwest:
    all_pois_gdf = gpd.GeoDataFrame(pd.concat(all_pois_innerwest, ignore_index=True), crs="EPSG:4283")
    all_pois_gdf.to_postgis("pois_innerwest", con=db, if_exists="replace", index=False)
    print(f"Uploaded {len(all_pois_gdf)} POIs.")
else:
    print("No POIs collected.")

#city
if all_pois_city:
    all_pois_gdf = gpd.GeoDataFrame(pd.concat(all_pois_city, ignore_index=True), crs="EPSG:4283")
    all_pois_gdf.to_postgis("pois_city", con=db, if_exists="replace", index=False)
    print(f"Uploaded {len(all_pois_gdf)} POIs.")
else:
    print("No POIs collected.")

Uploaded 5650 POIs.
Uploaded 3461 POIs.
Uploaded 3397 POIs.

## Task 3

## Task 3

### Inner West part

In [64]:
sql_stops = """
SELECT sa2_code21,
       sa2_name21,
       COUNT(*) AS n_stops
FROM   "Stops"
WHERE  sa4_name21 = 'Sydney - Inner West'
GROUP BY sa2_code21,
         sa2_name21;
"""

stop_counts = pd.read_sql(sql_stops, conn)
stop_counts.head()

  sa2_code21              sa2_name21  n_stops
0  120031680      Strathfield - East      114
1  120021387                 Balmain       74
2  120031393  Croydon Park - Enfield      114
3  120011386  Five Dock - Abbotsford      185
4  120031576       Strathfield South       46

In [66]:
import geopandas as gpd
innerwest_query = """
SELECT sa2_code21, sa2_name21, geometry
FROM sa2_regions
WHERE sa4_name21 = 'Sydney - Inner West';
"""

sa2_innerwest = gpd.read_postgis(innerwest_query, conn, geom_col='geometry')
sa2_innerwest.crs = "EPSG:4283"

In [68]:
primary_query = "SELECT * FROM catchments_primary;"
secondary_query = "SELECT * FROM catchments_secondary;"
future_query = "SELECT * FROM catchments_future;"

primary_schools = gpd.read_postgis(primary_query, conn, geom_col='geometry')
secondary_schools = gpd.read_postgis(secondary_query, conn, geom_col='geometry')
future_schools = gpd.read_postgis(future_query, conn, geom_col='geometry')

primary_schools["school_type"] = "primary"
secondary_schools["school_type"] = "secondary"
future_schools["school_type"] = "future"

In [70]:
all_schools_combined = pd.concat(
    [primary_schools, secondary_schools, future_schools],
    ignore_index=True
)

schools_with_sa2_match = gpd.sjoin(
    all_schools_combined,
    sa2_innerwest,
    predicate="intersects"
)

In [72]:
school_counts_by_sa2 = schools_with_sa2_match.groupby(
    ["sa2_code21", "sa2_name21", "school_type"]
).size().unstack(fill_value=0).reset_index()

school_counts_by_sa2["total_schools"] = (
    school_counts_by_sa2.get("primary", 0) +
    school_counts_by_sa2.get("secondary", 0) +
    school_counts_by_sa2.get("future", 0)
)

school_counts_by_sa2.head()

school_type,sa2_code21,sa2_name21,future,primary,secondary,total_schools
0,120011383,Concord - Mortlake - Cabarita,0,4,4,8
1,120011385,Drummoyne - Rodd Point,1,4,5,10
2,120011386,Five Dock - Abbotsford,0,7,3,10
3,120011672,Concord West - North Strathfield,0,5,3,8
4,120011673,Rhodes,0,2,2,4

In [74]:
sql_population = """
SELECT 
    "sa2_code",
    "age_5_9",
    "age_10_14 ",
    "age_15_19"
FROM "Population"
WHERE "sa2_code" IS NOT NULL;
"""

population_youth = pd.read_sql(sql_population, conn)
population_youth["youth_total"] = (
    population_youth["age_5_9"] +
    population_youth["age_10_14 "] +
    population_youth["age_15_19"]
)
population_youth.head()

    sa2_code  age_5_9  age_10_14   age_15_19  youth_total
0  102011028      522         623        552         1697
1  102011029      666         702        592         1960
2  102011030      225         258        278          761
3  102011031      804         880        838         2522
4  102011032     1044        1084       1072         3200

In [76]:
population_youth["sa2_code"] = population_youth["sa2_code"].astype(str)
schools_with_youth = school_counts_by_sa2.merge(
    population_youth,
    left_on="sa2_code21",
    right_on="sa2_code",
    how="left"
)

In [78]:
schools_with_youth["schools_per_1000_youth"] = (
    schools_with_youth["total_schools"] / schools_with_youth["youth_total"]
) * 1000
schools_with_youth.head()

,sa2_code21,sa2_name21,future,primary,secondary,total_schools,sa2_code,age_5_9,age_10_14,age_15_19,youth_total,schools_per_1000_youth
0,120011383,Concord - Mortlake - Cabarita,0,4,4,8,120011383,1268,1368,1261,3897,2.052861
1,120011385,Drummoyne - Rodd Point,1,4,5,10,120011385,1023,1103,900,3026,3.304693
2,120011386,Five Dock - Abbotsford,0,7,3,10,120011386,1155,1158,969,3282,3.046923
3,120011672,Concord West - North Strathfield,0,5,3,8,120011672,783,795,735,2313,3.458712
4,120011673,Rhodes,0,2,2,4,120011673,404,199,206,809,4.944376

In [80]:
from sqlalchemy import text
# Extract library POIs and count them per SA2
sql_library_counts = """
SELECT sa2_name,
       COUNT(*) AS n_libraries
FROM "pois_innerwest"
WHERE LOWER(poitype) LIKE '%library%' 
   OR LOWER(poilabel) LIKE '%library%'
GROUP BY sa2_name
ORDER BY n_libraries DESC;
"""

library_counts = pd.read_sql_query(text(sql_library_counts), conn)
library_counts.head()

                           sa2_name  n_libraries
0     Concord - Mortlake - Cabarita            2
1                Strathfield - West            2
2  Concord West - North Strathfield            2
3                     Burwood (NSW)            1
4            Drummoyne - Rodd Point            1

In [82]:
sql_park_counts = """
SELECT sa2_name,
       COUNT(*) AS n_parks
FROM "pois_innerwest"
WHERE LOWER(poitype) LIKE '%park%'
   OR LOWER(poilabel) LIKE '%park%'
GROUP BY sa2_name
ORDER BY n_parks DESC;
"""

park_counts = pd.read_sql_query(text(sql_park_counts), conn)
park_counts.head()

                           sa2_name  n_parks
0            Drummoyne - Rodd Point       72
1            Five Dock - Abbotsford       64
2     Concord - Mortlake - Cabarita       59
3  Concord West - North Strathfield       54
4                           Balmain       53

In [84]:
from sqlalchemy import text
sql_business_counts = """
SELECT sa2_code,
       sa2_name,
       SUM(total_businesses) AS n_businesses
FROM "Businesses"
WHERE "industry_code " = 'G'
GROUP BY sa2_code, sa2_name
ORDER BY n_businesses DESC;
"""

business_counts = pd.read_sql_query(text(sql_business_counts), conn)
business_counts.head()

    sa2_code                        sa2_name  n_businesses
0  117031644  Sydney (North) - Millers Point          1307
1  199999499               Currently Unknown           537
2  117031645      Sydney (South) - Haymarket           472
3  117031336                     Surry Hills           343
4  121011684                Chatswood - East           338

In [86]:
sql_population_total = """
SELECT "sa2_code",
       "total"
FROM "Population"
"""
population_total = pd.read_sql_query(text(sql_population_total), conn)

business_with_pop = business_counts.merge(
    population_total, on="sa2_code", how="left"
)

business_with_pop["businesses_per_1000"] = (
    business_with_pop["n_businesses"] / business_with_pop["total"]
) * 1000
business_with_pop.head()

,sa2_code,sa2_name,n_businesses,total,businesses_per_1000
0,117031644,Sydney (North) - Millers Point,1307,8199.0,159.409684
1,199999499,Currently Unknown,537,NaN,NaN
2,117031645,Sydney (South) - Haymarket,472,20346.0,23.198663
3,117031336,Surry Hills,343,16053.0,21.366723
4,121011684,Chatswood - East,338,19770.0,17.096611

In [88]:
combined = stop_counts.merge(
    schools_with_youth[["sa2_code", "schools_per_1000_youth"]],
    left_on="sa2_code21", right_on="sa2_code", how="left"
)

combined = combined.merge(
    park_counts.rename(columns={"sa2_name": "sa2_name21"}),
    on="sa2_name21", how="left"
)

combined = combined.merge(
    business_with_pop.rename(columns={"sa2_name": "sa2_name21"}),
    on="sa2_name21", how="left"
)

combined = combined.rename(columns={
    "n_stops": "stops",
    "schools_per_1000_youth": "schools",
    "n_libraries": "libraries",
    "n_parks": "parks",
    "businesses_per_1000": "businesses"
})

combined = combined.fillna(0)

combined.head()

,sa2_code21,sa2_name21,stops,sa2_code_x,schools,parks,sa2_code_y,n_businesses,total,businesses
0,120031680,Strathfield - East,114,120031680,6.823821,29,120031680,126,16583.0,7.598143
1,120021387,Balmain,74,120021387,2.822581,53,120021387,112,15629.0,7.166165
2,120031393,Croydon Park - Enfield,114,120031393,5.275305,45,120031393,100,17459.0,5.727705
3,120011386,Five Dock - Abbotsford,185,120011386,3.046923,64,120011386,181,20999.0,8.619458
4,120031576,Strathfield South,46,120031576,14.925373,24,120031576,36,3648.0,9.868421

In [90]:
# Compute z-scores
combined["z_stops"] = (combined["stops"] - combined["stops"].mean()) / combined["stops"].std()
combined["z_schools"] = (combined["schools"] - combined["schools"].mean()) / combined["schools"].std()
combined["z_parks"] = (combined["parks"] - combined["parks"].mean()) / combined["parks"].std()
combined["z_businesses"] = (combined["businesses"] - combined["businesses"].mean()) / combined["businesses"].std()

In [92]:
# Total z-score
combined["z_total"] = (
    combined["z_stops"] +
    combined["z_schools"] +
    combined["z_parks"] +
    combined["z_businesses"]
)
combined_ns = combined.drop(columns=["sa2_code_x", "sa2_code_y", "n_businesses", "total"])
combined.head()

,sa2_code21,sa2_name21,stops,schools,parks,businesses,z_stops,z_schools,z_parks,z_businesses,z_total
0,120031680,Strathfield - East,114,6.823821,29,7.598143,0.387941,0.338232,-0.776450,-0.009933,-0.060209
1,120021387,Balmain,74,2.822581,53,7.166165,-0.614738,-1.065259,0.860917,-0.195727,-1.014807
2,120031393,Croydon Park - Enfield,114,5.275305,45,5.727705,0.387941,-0.204932,0.315128,-0.814413,-0.316276
3,120011386,Five Dock - Abbotsford,185,3.046923,64,8.619458,2.167696,-0.986568,1.611377,0.429338,3.221843
4,120031576,Strathfield South,46,14.925373,24,9.868421,-1.316613,3.179966,-1.117568,0.966520,1.712305

In [94]:
import numpy as np
final_scores = combined
final_scores["real_score"] = 1 / (1 + np.exp(-final_scores["z_total"]))
final_scores = final_scores.reset_index(drop=True)
final_scores

,sa2_code21,sa2_name21,stops,schools,parks,businesses,z_stops,z_schools,z_parks,z_businesses,z_total,real_score
0,120031680,Strathfield - East,114,6.823821,29,7.598143,0.387941,0.338232,-0.776450,-0.009933,-0.060209,0.484952
1,120021387,Balmain,74,2.822581,53,7.166165,-0.614738,-1.065259,0.860917,-0.195727,-1.014807,0.266040
2,120031393,Croydon Park - Enfield,114,5.275305,45,5.727705,0.387941,-0.204932,0.315128,-0.814413,-0.316276,0.421584
3,120011386,Five Dock - Abbotsford,185,3.046923,64,8.619458,2.167696,-0.986568,1.611377,0.429338,3.221843,0.961648
4,120031576,Strathfield South,46,14.925373,24,9.868421,-1.316613,3.179966,-1.117568,0.966520,1.712305,0.847135
5,120031394,Dulwich Hill - Lewisham,90,8.267879,41,4.764807,-0.213666,0.844756,0.042234,-1.228558,-0.555235,0.364651
6,120031395,Haberfield - Summer Hill,111,9.302326,42,5.607615,0.312740,1.207603,0.110457,-0.866064,0.764736,0.682381
7,120031679,Croydon,94,6.193694,37,5.546967,-0.113398,0.117206,-0.230661,-0.892149,-1.119002,0.246196
8,120031678,Burwood (NSW),74,8.293020,30,13.397308,-0.614738,0.853575,-0.708226,2.484304,2.014915,0.882354
9,120011672,Concord West - North Strathfield,77,3.458712,54,6.730100,-0.539537,-0.842127,0.929141,-0.383280,-0.835804,0.302419
10,120031396,Homebush,75,4.396483,48,10.417162,-0.589671,-0.513191,0.519799,1.202535,0.619472,0.650099
11,120021675,Leichhardt,96,4.690117,35,9.018718,-0.063264,-0.410194,-0.367108,0.601061,-0.239506,0.440408
12,120011673,Rhodes,43,4.944376,22,10.662998,-1.391814,-0.321010,-1.254015,1.308270,-1.658569,0.159954
13,120011383,Concord - Mortlake - Cabarita,181,2.052861,59,7.498707,2.067428,-1.335249,1.270259,-0.052700,1.949737,0.875418
14,120011385,Drummoyne - Rodd Point,139,3.304693,72,8.475497,1.014616,-0.896152,2.157166,0.367420,2.643049,0.933581
15,120031677,Ashfield - South,107,7.988381,22,6.599316,0.212472,0.746718,-1.254015,-0.439531,-0.734356,0.324240
16,120021674,Annandale (NSW),40,6.228374,28,8.827238,-1.467015,0.129371,-0.844673,0.518705,-1.663613,0.159278
17,120021389,Lilyfield - Rozelle,86,5.420054,51,7.931358,-0.313934,-0.154159,0.724470,0.133384,0.389761,0.596225
18,120031681,Strathfield - West,149,4.686585,42,7.425743,1.265285,-0.411434,0.110457,-0.084083,0.880226,0.706869
19,120031392,Canterbury (North) - Ashbury,105,6.010929,26,3.817744,0.162338,0.053099,-0.981121,-1.635893,-2.401576,0.083053
20,120031676,Ashfield - North,69,4.918033,24,4.344804,-0.740073,-0.330250,-1.117568,-1.409203,-3.597093,0.026672

### North Sydney And Hornsby

In [ ]:
# make sure any earlier error is cleared
conn.rollback()          # <-- this resets the transaction block

sql_stops = """
SELECT sa2_code21,
       sa2_name21,
       COUNT(*) AS n_stops
FROM   Stops               
WHERE  sa4_name21 = 'Sydney - North Sydney and Hornsby'
GROUP  BY sa2_code21,
          sa2_name21;
"""

stop_counts = pd.read_sql(sql_stops, conn)
stop_counts.head()

In [ ]:
northsyd_query = """
SELECT sa2_code21, sa2_name21, geometry
FROM sa2_regions
WHERE sa4_name21 = 'Sydney - North Sydney and Hornsby';
"""

sa2_northsyd = gpd.read_postgis(northsyd_query, conn, geom_col='geometry')
sa2_northsyd.crs = "EPSG:4283"

sql_primary = "SELECT * FROM catchments_primary;"
sql_second = "SELECT * FROM catchments_secondary;"
sql_future = "SELECT * FROM catchments_future;"

In [ ]:
primary = gpd.read_postgis(sql_primary, conn, geom_col='geometry')
secondary= gpd.read_postgis(sql_second, conn, geom_col='geometry')
future = gpd.read_postgis(sql_future, conn, geom_col='geometry')

primary["school_type"] = "primary"
secondary["school_type"] = "secondary"
future["school_type"] = "future"

In [ ]:
all_schools_combined = pd.concat(
    [primary, secondary, future],
    ignore_index=True
)

schools_sa2 = gpd.sjoin(
    all_schools_combined,
    sa2_northsyd,
    predicate="intersects"
)

In [ ]:
school_counts_sa2 = schools_sa2.groupby(
    ["sa2_code21", "sa2_name21", "school_type"]
).size().unstack(fill_value=0).reset_index()

school_counts_sa2["total_schools"] = (
    school_counts_sa2.get("primary", 0) +
    school_counts_sa2.get("secondary", 0) +
    school_counts_sa2.get("future", 0)
)

school_counts_sa2.head()

In [ ]:
conn.rollback()   

sql_population = """
SELECT 
    "sa2_code",
    "age_5_9",
    "age_10_14",
    "age_15_19"
FROM "Population"
WHERE "sa2_code" IS NOT NULL;
"""

In [ ]:
population_youth = pd.read_sql(sql_population, conn)
population_youth["youth_total"] = (
    population_youth["age_5_9"] +
    population_youth["age_10_14"] +
    population_youth["age_15_19"]
)
population_youth.head()

In [ ]:
population_youth["sa2_code"] = population_youth["sa2_code"].astype(str)
schools_with_youth = school_counts_sa2.merge(
    population_youth,
    left_on="sa2_code21",
    right_on="sa2_code",
    how="left"
)

In [ ]:
schools_with_youth["schools_per_1000_youth"] = (
    schools_with_youth["total_schools"] / schools_with_youth["youth_total"]
) * 1000
schools_with_youth.head()

In [ ]:
conn.rollback()  

from sqlalchemy import text
sql_business_counts = """
SELECT sa2_code,
       sa2_name,
       SUM(total_businesses) AS n_businesses
FROM "Businesses"
WHERE industry_code = 'G'
GROUP BY sa2_code, sa2_name
ORDER BY n_businesses DESC;
"""

In [ ]:
business_counts = pd.read_sql_query(text(sql_business_counts), conn)
business_counts.head()

In [ ]:

conn.rollback()  
sql_population_total = """
SELECT "sa2_code",
       "total"
FROM "Population"
"""

In [ ]:
population_total = pd.read_sql_query(text(sql_population_total), conn)

business_pop = business_counts.merge(
    population_total, on="sa2_code", how="left"
)

business_pop["businesses_per_1000"] = (
    business_pop["n_businesses"] / business_pop["total"]
) * 1000
business_pop.head()

In [ ]:
sql_park_counts = """
SELECT sa2_name,
       COUNT(*) AS n_parks
FROM "pois_northSydney"
WHERE LOWER(poitype) LIKE '%park%'
   OR LOWER(poilabel) LIKE '%park%'
GROUP BY sa2_name
ORDER BY n_parks DESC;
"""

park_counts = pd.read_sql_query(text(sql_park_counts), conn)
park_counts.head()

In [ ]:
conn.rollback()  

combined_ns = stop_counts.merge(
    schools_with_youth[["sa2_code", "schools_per_1000_youth"]],
    left_on="sa2_code21", right_on="sa2_code", how="left"
)

combined_ns = combined_ns.merge(
    park_counts.rename(columns={"sa2_name": "sa2_name21"}),
    on="sa2_name21", how="left"
)

combined_ns = combined_ns.merge(
    business_pop.rename(columns={"sa2_name": "sa2_name21"}),
    on="sa2_name21", how="left"
)

combined_ns = combined_ns.rename(columns={
    "n_stops": "stops",
    "schools_per_1000_youth": "schools",
    "n_parks": "parks",
    "businesses_per_1000": "businesses"
})

combined_ns = combined_ns.fillna(0)

combined_ns.head()

In [ ]:
# Compute z-scores
combined_ns["z_stops"] = (combined_ns["stops"] - combined_ns["stops"].mean()) / combined_ns["stops"].std()
combined_ns["z_schools"] = (combined_ns["schools"] - combined_ns["schools"].mean()) / combined_ns["schools"].std()
combined_ns["z_businesses"] = (combined_ns["businesses"] - combined_ns["businesses"].mean()) / combined_ns["businesses"].std()
combined_ns["z_parks"] = (combined_ns["parks"] - combined_ns["parks"].mean()) / combined["parks"].std()

In [ ]:
# Total z-score
combined_ns["z_total"] = (
    combined_ns["z_stops"] +
    combined_ns["z_schools"] +
    combined_ns["z_parks"] +
    combined_ns["z_businesses"]
)
combined_ns = combined_ns.drop(columns=["sa2_code_x", "sa2_code_y", "n_businesses", "total"])
combined_ns.head()

In [ ]:
import numpy as np
final_scores_ns = combined_ns
final_scores_ns["real_score"] = 1 / (1 + np.exp(-final_scores_ns["z_total"]))
final_scores_ns = final_scores_ns.reset_index(drop=True)
final_scores_ns